RT-Thread/rt-thread/bsp/stm32/libraries/STM32U5xx_HAL/STM32U5xx_HAL_Driver/Inc/stm32u5xx_ll_dma.h
/** @defgroup DMA_LL_EC_TRANSFER_EVENT_MODE Transfer Event Mode
  * @{
  */
#define LL_DMA_TCEM_BLK_TRANSFER         0x00000000U       /*!< The TC (and the HT) event is generated at the
                                                                (respectively half) end of each block                 */
#define LL_DMA_TCEM_RPT_BLK_TRANSFER     DMA_CTR2_TCEM_0   /*!< The TC (and the HT) event is generated at the
                                                                (respectively half) end of the repeated block         */
#define LL_DMA_TCEM_EACH_LLITEM_TRANSFER DMA_CTR2_TCEM_1   /*!< The TC (and the HT) event is generated at the
                                                                (respectively half) end of each linked-list item      */
#define LL_DMA_TCEM_LAST_LLITEM_TRANSFER DMA_CTR2_TCEM     /*!< The TC (and the HT) event is generated at the
                                                                (respectively half) end of the last linked-list item  */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_TRIGGER_POLARITY Trigger Polarity
  * @{
  */
#define LL_DMA_TRIG_POLARITY_MASKED    0x00000000U         /*!< No trigger of the selected DMA request.
                                                                Masked trigger event                                  */
#define LL_DMA_TRIG_POLARITY_RISING    DMA_CTR2_TRIGPOL_0  /*!< Trigger of the selected DMA request on the rising
                                                                edge of the selected trigger event input              */
#define LL_DMA_TRIG_POLARITY_FALLING   DMA_CTR2_TRIGPOL_1  /*!< Trigger of the selected DMA request on the falling
                                                                edge of the selected trigger event input              */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_TRIGGER_MODE Transfer Trigger Mode
  * @{
  */
#define LL_DMA_TRIGM_BLK_TRANSFER        0x00000000U      /*!< A block transfer is conditioned by (at least)
                                                               one hit trigger                                        */
#define LL_DMA_TRIGM_RPT_BLK_TRANSFER    DMA_CTR2_TRIGM_0 /*!< A repeated block transfer is conditioned by (at least)
                                                               one hit trigger                                        */
#define LL_DMA_TRIGM_LLI_LINK_TRANSFER   DMA_CTR2_TRIGM_1 /*!< A LLI link transfer is conditioned by (at least)
                                                               one hit trigger                                        */
#define LL_DMA_TRIGM_SINGLBURST_TRANSFER DMA_CTR2_TRIGM   /*!< A Single/Burst transfer is conditioned by (at least)
                                                               one hit trigger                                        */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_TRANSFER_DIRECTION Transfer Direction
  * @{
  */
#define LL_DMA_DIRECTION_MEMORY_TO_MEMORY DMA_CTR2_SWREQ /*!< Memory to memory direction     */
#define LL_DMA_DIRECTION_PERIPH_TO_MEMORY 0x00000000U    /*!< Peripheral to memory direction */
#define LL_DMA_DIRECTION_MEMORY_TO_PERIPH DMA_CTR2_DREQ  /*!< Memory to peripheral direction */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_BLK_RPT_SRC_ADDR_UPDATE_MODE Block Repeat Source Address Update Mode
  * @{
  */
#define LL_DMA_BLKRPT_SRC_ADDR_INCREMENT 0x00000000U     /*!< Source address pointer is incremented after each block
                                                              transfer by source update value                         */
#define LL_DMA_BLKRPT_SRC_ADDR_DECREMENT DMA_CBR1_BRSDEC /*!< Source address pointer is decremented after each block
                                                              transfer by source update value                         */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_BLK_RPT_DEST_ADDR_UPDATE_MODE Block Repeat Destination Address Update Mode
  * @{
  */
#define LL_DMA_BLKRPT_DEST_ADDR_INCREMENT 0x00000000U     /*!< Destination address is incremented after each block
                                                               transfer by destination update value                   */
#define LL_DMA_BLKRPT_DEST_ADDR_DECREMENT DMA_CBR1_BRDDEC /*!< Destination address is decremented after each block
                                                               transfer by destination update value                   */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_SRC_ADDR_UPDATE_MODE Burst Source Address Update Mode
  * @{
  */
#define LL_DMA_BURST_SRC_ADDR_INCREMENT 0x00000000U   /*!< Source address pointer is incremented after each burst
                                                           transfer by source update value                            */
#define LL_DMA_BURST_SRC_ADDR_DECREMENT DMA_CBR1_SDEC /*!< Source address pointer is decremented after each burst
                                                           transfer by source update value                            */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_DEST_ADDR_UPDATE_MODE Burst Destination Address Update Mode
  * @{
  */
#define LL_DMA_BURST_DEST_ADDR_INCREMENT 0x00000000U   /*!< Destination address pointer is incremented after each
                                                            burst transfer by destination update value                */
#define LL_DMA_BURST_DEST_ADDR_DECREMENT DMA_CBR1_DDEC /*!< Destination address pointer is decremented after each
                                                            burst transfer by destination update value                */
/**
  * @}
  */

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/** @defgroup DMA_LL_EC_SOURCE_SECURITY_ATTRIBUTE Source Security Attribute
  * @{
  */
#define LL_DMA_CHANNEL_NSEC 0x00000000U /*!< NSecure channel */
#define LL_DMA_CHANNEL_SEC  0x00000001U /*!< Secure channel  */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_SOURCE_SECURITY_ATTRIBUTE Source Security Attribute
  * @{
  */
#define LL_DMA_CHANNEL_SRC_NSEC 0x00000000U   /*!< NSecure transfer from the source */
#define LL_DMA_CHANNEL_SRC_SEC  DMA_CTR1_SSEC /*!< Secure transfer from the source  */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_DESTINATION_SECURITY_ATTRIBUTE Destination Security Attribute
  * @{
  */
#define LL_DMA_CHANNEL_DEST_NSEC 0x00000000U   /*!< NSecure transfer from the destination */
#define LL_DMA_CHANNEL_DEST_SEC  DMA_CTR1_DSEC /*!< Secure transfer from the destination  */
/**
  * @}
  */
#endif /* defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

/** @defgroup DMA_LL_EC_LINKEDLIST_NODE_TYPE Linked list node type
  * @{
  */
#define LL_DMA_LPDMA_LINEAR_NODE 0x00U /*!< LPDMA node : linear addressing node      */
#define LL_DMA_GPDMA_LINEAR_NODE 0x01U /*!< GPDMA node : linear addressing node      */
#define LL_DMA_GPDMA_2D_NODE     0x02U /*!< GPDMA node : 2 dimension addressing node */

/**
  * @}
  */

/** @defgroup DMA_LL_EC_LINKEDLIST_REGISTER_UPDATE Linked list register update
  * @{
  */
#define LL_DMA_UPDATE_CTR1 DMA_CLLR_UT1 /*!< Update CTR1 register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CTR2 DMA_CLLR_UT2 /*!< Update CTR2 register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CBR1 DMA_CLLR_UB1 /*!< Update CBR1 register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CSAR DMA_CLLR_USA /*!< Update CSAR register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CDAR DMA_CLLR_UDA /*!< Update CDAR register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CTR3 DMA_CLLR_UT3 /*!< Update CTR3 register from memory :
                                             available only for 2D addressing DMA channels */
#define LL_DMA_UPDATE_CBR2 DMA_CLLR_UB2 /*!< Update CBR2 register from memory :
                                             available only for 2D addressing DMA channels */
#define LL_DMA_UPDATE_CLLR DMA_CLLR_ULL /*!< Update CLLR register from memory :
                                             available for all DMA channels                */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_REQUEST_SELECTION Request Selection
  * @{
  */
/* GPDMA1 Hardware Requests */
#define LL_GPDMA1_REQUEST_ADC1         0U   /*!< GPDMA1 HW Request is ADC1         */
#define LL_GPDMA1_REQUEST_ADC4         1U   /*!< GPDMA1 HW Request is ADC4         */
#define LL_GPDMA1_REQUEST_DAC1_CH1     2U   /*!< GPDMA1 HW Request is DAC1_CH1     */
#define LL_GPDMA1_REQUEST_DAC1_CH2     3U   /*!< GPDMA1 HW Request is DAC1_CH2     */
#define LL_GPDMA1_REQUEST_TIM6_UP      4U   /*!< GPDMA1 HW Request is TIM6_UP      */
#define LL_GPDMA1_REQUEST_TIM7_UP      5U   /*!< GPDMA1 HW Request is TIM7_UP      */
#define LL_GPDMA1_REQUEST_SPI1_RX      6U   /*!< GPDMA1 HW Request is SPI1_RX      */
#define LL_GPDMA1_REQUEST_SPI1_TX      7U   /*!< GPDMA1 HW Request is SPI1_TX      */
#define LL_GPDMA1_REQUEST_SPI2_RX      8U   /*!< GPDMA1 HW Request is SPI2_RX      */
#define LL_GPDMA1_REQUEST_SPI2_TX      9U   /*!< GPDMA1 HW Request is SPI2_TX      */
#define LL_GPDMA1_REQUEST_SPI3_RX      10U  /*!< GPDMA1 HW Request is SPI3_RX      */
#define LL_GPDMA1_REQUEST_SPI3_TX      11U  /*!< GPDMA1 HW Request is SPI3_TX      */
#define LL_GPDMA1_REQUEST_I2C1_RX      12U  /*!< GPDMA1 HW Request is I2C1_RX      */
#define LL_GPDMA1_REQUEST_I2C1_TX      13U  /*!< GPDMA1 HW Request is I2C1_TX      */
#define LL_GPDMA1_REQUEST_I2C1_EVC     14U  /*!< GPDMA1 HW Request is I2C1_EVC     */
#define LL_GPDMA1_REQUEST_I2C2_RX      15U  /*!< GPDMA1 HW Request is I2C2_RX      */
#define LL_GPDMA1_REQUEST_I2C2_TX      16U  /*!< GPDMA1 HW Request is I2C2_TX      */
#define LL_GPDMA1_REQUEST_I2C2_EVC     17U  /*!< GPDMA1 HW Request is I2C2_EVC     */
#define LL_GPDMA1_REQUEST_I2C3_RX      18U  /*!< GPDMA1 HW Request is I2C3_RX      */
#define LL_GPDMA1_REQUEST_I2C3_TX      19U  /*!< GPDMA1 HW Request is I2C3_TX      */
#define LL_GPDMA1_REQUEST_I2C3_EVC     20U  /*!< GPDMA1 HW Request is I2C3_EVC     */
#define LL_GPDMA1_REQUEST_I2C4_RX      21U  /*!< GPDMA1 HW Request is I2C4_RX      */
#define LL_GPDMA1_REQUEST_I2C4_TX      22U  /*!< GPDMA1 HW Request is I2C4_TX      */
#define LL_GPDMA1_REQUEST_I2C4_EVC     23U  /*!< GPDMA1 HW Request is I2C4_EVC     */
#define LL_GPDMA1_REQUEST_USART1_RX    24U  /*!< GPDMA1 HW Request is USART1_RX    */
#define LL_GPDMA1_REQUEST_USART1_TX    25U  /*!< GPDMA1 HW Request is USART1_TX    */
#define LL_GPDMA1_REQUEST_USART2_RX    26U  /*!< GPDMA1 HW Request is USART2_RX    */
#define LL_GPDMA1_REQUEST_USART2_TX    27U  /*!< GPDMA1 HW Request is USART2_TX    */
#define LL_GPDMA1_REQUEST_USART3_RX    28U  /*!< GPDMA1 HW Request is USART3_RX    */
#define LL_GPDMA1_REQUEST_USART3_TX    29U  /*!< GPDMA1 HW Request is USART3_TX    */
#define LL_GPDMA1_REQUEST_UART4_RX     30U  /*!< GPDMA1 HW Request is UART4_RX     */
#define LL_GPDMA1_REQUEST_UART4_TX     31U  /*!< GPDMA1 HW Request is UART4_TX     */
#define LL_GPDMA1_REQUEST_UART5_RX     32U  /*!< GPDMA1 HW Request is UART5_RX     */
#define LL_GPDMA1_REQUEST_UART5_TX     33U  /*!< GPDMA1 HW Request is UART5_TX     */
#define LL_GPDMA1_REQUEST_LPUART1_RX   34U  /*!< GPDMA1 HW Request is LPUART1_RX   */
#define LL_GPDMA1_REQUEST_LPUART1_TX   35U  /*!< GPDMA1 HW Request is LPUART1_TX   */
#define LL_GPDMA1_REQUEST_SAI1_A       36U  /*!< GPDMA1 HW Request is SAI1_A       */
#define LL_GPDMA1_REQUEST_SAI1_B       37U  /*!< GPDMA1 HW Request is SAI1_B       */
#define LL_GPDMA1_REQUEST_SAI2_A       38U  /*!< GPDMA1 HW Request is SAI2_A       */
#define LL_GPDMA1_REQUEST_SAI2_B       39U  /*!< GPDMA1 HW Request is SAI2_B       */
#define LL_GPDMA1_REQUEST_OCTOSPI1     40U  /*!< GPDMA1 HW Request is OCTOSPI1     */
#define LL_GPDMA1_REQUEST_OCTOSPI2     41U  /*!< GPDMA1 HW Request is OCTOSPI2     */
#define LL_GPDMA1_REQUEST_TIM1_CH1     42U  /*!< GPDMA1 HW Request is TIM1_CH1     */
#define LL_GPDMA1_REQUEST_TIM1_CH2     43U  /*!< GPDMA1 HW Request is TIM1_CH2     */
#define LL_GPDMA1_REQUEST_TIM1_CH3     44U  /*!< GPDMA1 HW Request is TIM1_CH3     */
#define LL_GPDMA1_REQUEST_TIM1_CH4     45U  /*!< GPDMA1 HW Request is TIM1_CH4     */
#define LL_GPDMA1_REQUEST_TIM1_UP      46U  /*!< GPDMA1 HW Request is TIM1_UP      */
#define LL_GPDMA1_REQUEST_TIM1_TRIG    47U  /*!< GPDMA1 HW Request is TIM1_TRIG    */
#define LL_GPDMA1_REQUEST_TIM1_COM     48U  /*!< GPDMA1 HW Request is TIM1_COM     */
#define LL_GPDMA1_REQUEST_TIM8_CH1     49U  /*!< GPDMA1 HW Request is TIM8_CH1     */
#define LL_GPDMA1_REQUEST_TIM8_CH2     50U  /*!< GPDMA1 HW Request is TIM8_CH2     */
#define LL_GPDMA1_REQUEST_TIM8_CH3     51U  /*!< GPDMA1 HW Request is TIM8_CH3     */
#define LL_GPDMA1_REQUEST_TIM8_CH4     52U  /*!< GPDMA1 HW Request is TIM8_CH4     */
#define LL_GPDMA1_REQUEST_TIM8_UP      53U  /*!< GPDMA1 HW Request is TIM8_UP      */
#define LL_GPDMA1_REQUEST_TIM8_TRIG    54U  /*!< GPDMA1 HW Request is TIM8_TRIG    */
#define LL_GPDMA1_REQUEST_TIM8_COM     55U  /*!< GPDMA1 HW Request is TIM8_COM     */
#define LL_GPDMA1_REQUEST_TIM2_CH1     56U  /*!< GPDMA1 HW Request is TIM2_CH1     */
#define LL_GPDMA1_REQUEST_TIM2_CH2     57U  /*!< GPDMA1 HW Request is TIM2_CH2     */
#define LL_GPDMA1_REQUEST_TIM2_CH3     58U  /*!< GPDMA1 HW Request is TIM2_CH3     */
#define LL_GPDMA1_REQUEST_TIM2_CH4     59U  /*!< GPDMA1 HW Request is TIM2_CH4     */
#define LL_GPDMA1_REQUEST_TIM2_UP      60U  /*!< GPDMA1 HW Request is TIM2_UP      */
#define LL_GPDMA1_REQUEST_TIM3_CH1     61U  /*!< GPDMA1 HW Request is TIM3_CH1     */
#define LL_GPDMA1_REQUEST_TIM3_CH2     62U  /*!< GPDMA1 HW Request is TIM3_CH2     */
#define LL_GPDMA1_REQUEST_TIM3_CH3     63U  /*!< GPDMA1 HW Request is TIM3_CH3     */
#define LL_GPDMA1_REQUEST_TIM3_CH4     64U  /*!< GPDMA1 HW Request is TIM3_CH4     */
#define LL_GPDMA1_REQUEST_TIM3_UP      65U  /*!< GPDMA1 HW Request is TIM3_UP      */
#define LL_GPDMA1_REQUEST_TIM3_TRIG    66U  /*!< GPDMA1 HW Request is TIM3_TRIG    */
#define LL_GPDMA1_REQUEST_TIM4_CH1     67U  /*!< GPDMA1 HW Request is TIM4_CH1     */
#define LL_GPDMA1_REQUEST_TIM4_CH2     68U  /*!< GPDMA1 HW Request is TIM4_CH2     */
#define LL_GPDMA1_REQUEST_TIM4_CH3     69U  /*!< GPDMA1 HW Request is TIM4_CH3     */
#define LL_GPDMA1_REQUEST_TIM4_CH4     70U  /*!< GPDMA1 HW Request is TIM4_CH4     */
#define LL_GPDMA1_REQUEST_TIM4_UP      71U  /*!< GPDMA1 HW Request is TIM4_UP      */
#define LL_GPDMA1_REQUEST_TIM5_CH1     72U  /*!< GPDMA1 HW Request is TIM5_CH1     */
#define LL_GPDMA1_REQUEST_TIM5_CH2     73U  /*!< GPDMA1 HW Request is TIM5_CH2     */
#define LL_GPDMA1_REQUEST_TIM5_CH3     74U  /*!< GPDMA1 HW Request is TIM5_CH3     */
#define LL_GPDMA1_REQUEST_TIM5_CH4     75U  /*!< GPDMA1 HW Request is TIM5_CH4     */
#define LL_GPDMA1_REQUEST_TIM5_UP      76U  /*!< GPDMA1 HW Request is TIM5_UP      */
#define LL_GPDMA1_REQUEST_TIM5_TRIG    77U  /*!< GPDMA1 HW Request is TIM5_TRIG    */
#define LL_GPDMA1_REQUEST_TIM15_CH1    78U  /*!< GPDMA1 HW Request is TIM15_CH1    */
#define LL_GPDMA1_REQUEST_TIM15_UP     79U  /*!< GPDMA1 HW Request is TIM15_UP     */
#define LL_GPDMA1_REQUEST_TIM15_TRIG   80U  /*!< GPDMA1 HW Request is TIM15_TRIG   */
#define LL_GPDMA1_REQUEST_TIM15_COM    81U  /*!< GPDMA1 HW Request is TIM15_COM    */
#define LL_GPDMA1_REQUEST_TIM16_CH1    82U  /*!< GPDMA1 HW Request is TIM16_CH1    */
#define LL_GPDMA1_REQUEST_TIM16_UP     83U  /*!< GPDMA1 HW Request is TIM16_UP     */
#define LL_GPDMA1_REQUEST_TIM17_CH1    84U  /*!< GPDMA1 HW Request is TIM17_CH1    */
#define LL_GPDMA1_REQUEST_TIM17_UP     85U  /*!< GPDMA1 HW Request is TIM17_UP     */
#define LL_GPDMA1_REQUEST_DCMI         86U  /*!< GPDMA1 HW Request is DCMI         */
#define LL_GPDMA1_REQUEST_AES_IN       87U  /*!< GPDMA1 HW Request is AES_IN       */
#define LL_GPDMA1_REQUEST_AES_OUT      88U  /*!< GPDMA1 HW Request is AES_OUT      */
#define LL_GPDMA1_REQUEST_HASH_IN      89U  /*!< GPDMA1 HW Request is HASH_IN      */
#define LL_GPDMA1_REQUEST_UCPD1_TX     90U  /*!< GPDMA1 HW Request is UCPD1_TX     */
#define LL_GPDMA1_REQUEST_UCPD1_RX     91U  /*!< GPDMA1 HW Request is UCPD1_RX     */
#define LL_GPDMA1_REQUEST_MDF1_FLT0    92U  /*!< GPDMA1 HW Request is MDF1_FLT0    */
#define LL_GPDMA1_REQUEST_MDF1_FLT1    93U  /*!< GPDMA1 HW Request is MDF1_FLT1    */
#define LL_GPDMA1_REQUEST_MDF1_FLT2    94U  /*!< GPDMA1 HW Request is MDF1_FLT2    */
#define LL_GPDMA1_REQUEST_MDF1_FLT3    95U  /*!< GPDMA1 HW Request is MDF1_FLT3    */
#define LL_GPDMA1_REQUEST_MDF1_FLT4    96U  /*!< GPDMA1 HW Request is MDF1_FLT4    */
#define LL_GPDMA1_REQUEST_MDF1_FLT5    97U  /*!< GPDMA1 HW Request is MDF1_FLT5    */
#define LL_GPDMA1_REQUEST_ADF1_FLT0    98U  /*!< GPDMA1 HW Request is ADF1_FLT0    */
#define LL_GPDMA1_REQUEST_FMAC_READ    99U  /*!< GPDMA1 HW Request is FMAC_READ    */
#define LL_GPDMA1_REQUEST_FMAC_WRITE   100U /*!< GPDMA1 HW Request is FMAC_WRITE   */
#define LL_GPDMA1_REQUEST_CORDIC_READ  101U /*!< GPDMA1 HW Request is CORDIC_READ  */
#define LL_GPDMA1_REQUEST_CORDIC_WRITE 102U /*!< GPDMA1 HW Request is CORDIC_WRITE */
#define LL_GPDMA1_REQUEST_SAES_IN      103U /*!< GPDMA1 HW Request is SAES_IN      */
#define LL_GPDMA1_REQUEST_SAES_OUT     104U /*!< GPDMA1 HW Request is SAES_OUT     */
#define LL_GPDMA1_REQUEST_LPTIM1_IC1   105U /*!< GPDMA1 HW Request is LPTIM1_IC1   */
#define LL_GPDMA1_REQUEST_LPTIM1_IC2   106U /*!< GPDMA1 HW Request is LPTIM1_IC2   */
#define LL_GPDMA1_REQUEST_LPTIM1_UE    107U /*!< GPDMA1 HW Request is LPTIM1_UE    */
#define LL_GPDMA1_REQUEST_LPTIM2_IC1   108U /*!< GPDMA1 HW Request is LPTIM2_IC1   */
#define LL_GPDMA1_REQUEST_LPTIM2_IC2   109U /*!< GPDMA1 HW Request is LPTIM2_IC2   */
#define LL_GPDMA1_REQUEST_LPTIM2_UE    110U /*!< GPDMA1 HW Request is LPTIM2_UE    */
#define LL_GPDMA1_REQUEST_LPTIM3_IC1   111U /*!< GPDMA1 HW Request is LPTIM3_IC1   */
#define LL_GPDMA1_REQUEST_LPTIM3_IC2   112U /*!< GPDMA1 HW Request is LPTIM3_IC2   */
#define LL_GPDMA1_REQUEST_LPTIM3_UE    113U /*!< GPDMA1 HW Request is LPTIM3_UE    */

/* LPDMA1 Hardware Requests */
#define LL_LPDMA1_REQUEST_LPUART1_RX   0U   /*!< LPDMA1 HW Request is LPUART1_RX   */
#define LL_LPDMA1_REQUEST_LPUART1_TX   1U   /*!< LPDMA1 HW Request is LPUART1_TX   */
#define LL_LPDMA1_REQUEST_SPI3_RX      2U   /*!< LPDMA1 HW Request is SPI3_RX      */
#define LL_LPDMA1_REQUEST_SPI3_TX      3U   /*!< LPDMA1 HW Request is SPI3_TX      */
#define LL_LPDMA1_REQUEST_I2C3_RX      4U   /*!< LPDMA1 HW Request is I2C3_RX      */
#define LL_LPDMA1_REQUEST_I2C3_TX      5U   /*!< LPDMA1 HW Request is I2C3_TX      */
#define LL_LPDMA1_REQUEST_I2C3_EVC     6U   /*!< LPDMA1 HW Request is I2C3_EVC     */
#define LL_LPDMA1_REQUEST_ADC4         7U   /*!< LPDMA1 HW Request is ADC4         */
#define LL_LPDMA1_REQUEST_DAC1_CH1     8U   /*!< LPDMA1 HW Request is DAC1_CH1     */
#define LL_LPDMA1_REQUEST_DAC1_CH2     9U   /*!< LPDMA1 HW Request is DAC1_CH2     */
#define LL_LPDMA1_REQUEST_ADF1_FLT0    10U  /*!< LPDMA1 HW Request is ADF1_FLT0    */
#define LL_LPDMA1_REQUEST_LPTIM1_IC1   11U  /*!< LPDMA1 HW Request is LPTIM1_IC1   */
#define LL_LPDMA1_REQUEST_LPTIM1_IC2   12U  /*!< LPDMA1 HW Request is LPTIM1_IC2   */
#define LL_LPDMA1_REQUEST_LPTIM1_UE    13U  /*!< LPDMA1 HW Request is LPTIM1_UE    */
#define LL_LPDMA1_REQUEST_LPTIM3_IC1   14U  /*!< LPDMA1 HW Request is LPTIM3_IC1   */
#define LL_LPDMA1_REQUEST_LPTIM3_IC2   15U  /*!< LPDMA1 HW Request is LPTIM3_IC2   */
#define LL_LPDMA1_REQUEST_LPTIM3_UE    16U  /*!< LPDMA1 HW Request is LPTIM3_UE    */
/**
  * @}
  */

